app/controllers/orders_controller.rb

    def create
        @user = User.first
        @product = Product.first
        # in the future you will have to get the user dynamically from the product dynamically.
        orders = Order.new(user_id: User.first.id, product_id: Product.first.id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "products".* FROM "products"
SELECT "orders".* FROM "orders" LIMIT $1  [["LIMIT", 11]]

    def update
        @orders = Order.find(params[:id])
        # p orders_params
        @orders.update(orders_params)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "product_id" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["product_id", 3], ["updated_at", "2023-01-26 22:33:01.341634"], ["id", 142]]

    def destroy
        order = Order.find(params[:id])
        if order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 126], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 2]]