app/controllers/orders_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    user = User.find(orders_params[:user_id])

    product = Product.find(orders_params[:product_id])