app/controllers/products_controller.rb

    def create
        product = Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "cost", "created_at", "updated_at", "user_id", "order_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "shirt"], ["price", 10.22], ["cost", 8.55], ["created_at", "2023-01-26 23:43:59.832398"], ["updated_at", "2023-01-26 23:43:59.832398"], ["user_id", 1], ["order_id", nil]]

    def update
        @product = Product.find(params[:id])
        @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "T-Shirt"], ["updated_at", "2023-01-26 19:47:34.368562"], ["id", 48]]

    def destroy
        @product = Product.find(params[:id])
        if @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 37]]